src_ext/Documents/УЗ_ПереводУченика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УЗ_ПереводУченика</Name>
			<BasedOn>
				<xr:Item>Catalog.УЗ_ФизЛица</xr:Item>
				<xr:Item>Catalog.УЗ_ГруппыОбучения</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УЗ_СоставГрупп</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаИз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаВ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ученики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ученик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_СоставГрупп.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УЗ_СоставГрупп</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Ученик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Состоит</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/Documents/УЗ_Урок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УЗ_Урок</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УЗ_СписанияСуммЗаУроки</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_Расходы</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_РасчетыПоЗарплате</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_ДвижениеДисконтныхКарт</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_ДополнительныеРасходы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Педагог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Помещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Статусы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаПедагога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтавкиПедагогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБонусов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДопРасходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачисленоПедагогу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДомашнееЗадание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаУрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ученики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СписатьОплату</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Явка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ученик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Абонемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заметка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Причина</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Скидки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДисконтнаяКарта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_ДисконтныеКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБонусов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НачисленияПедагогу</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачисления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеИзменять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_СтатьиДвиженияДенег</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/Documents/УЗ_ПереводУченика/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

//Перевод ученика (решение владельца 28.09.2026, В29 — как кадровый перевод в типовых): зачисление в группу (пусто
//«Из группы»), перевод из группы в группу, выбытие из группы (пусто «В группу») с даты документа. Источник истины
//состава — регистр УЗ_СоставГрупп (пишет только этот документ). Проведение:
//  1. строит ПЛАН (ПланПеревода — одна функция для проведения, отмены проведения и предпросмотра формы): из каких
//     непроведённых уроков группы «Из» с даты ученик уйдёт, в какие непроведённые уроки группы «В» добавится;
//  2. проверяет всё целиком: ученик в группе «Из» на дату, не выбыл (В18) и не состоит уже в группе «В»; нет
//     проведённых уроков, из которых перевод «вынул» бы ученика задним числом (как заморозка В17 — отказ с перечнем
//     уроков); нет более позднего документа по тем же ученику и группе (сначала его отменить, как в кадровом учёте);
//     разные предметы групп — предупреждение (абонемент предмета «Из» к урокам «В» не подойдёт);
//  3. только после этого пишет регистр и перестраивает планы — всё в транзакции проведения. Проведённые уроки не
//     меняются никогда. Урок-план, в котором не осталось учеников, остаётся (это расписание группы, как занятие
//     группы в типовых; следующий зачисленный попадёт в него), не помечается на удаление.
//Отмена проведения (и пометка удаления) — тот же план в обратную сторону: регистр без записей документа, планы
//возвращаются к прежнему составу. Перепроведение с другой датой — разница «было/станет» с меньшей из дат.

//Что документ пишет в регистр: ТаблицаЗаписей (Ученик, ГруппаОбучения, Период, Состоит) — по строке «Из» (выбыл,
//Состоит = Ложь) и «В» (Состоит = Истина) на каждого ученика, период — день документа.
Функция НовыеЗаписи(Объект) Экспорт

	Итог = ТаблицаЗаписей();
	День = НачалоДня(Объект.Дата);
	Для Каждого СтрокаУченика Из Объект.Ученики Цикл
		Если Не ЗначениеЗаполнено(СтрокаУченика.Ученик) Тогда
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ГруппаИз) Тогда
			ДобавитьЗапись(Итог, СтрокаУченика.Ученик, Объект.ГруппаИз, День, Ложь);
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ГруппаВ) Тогда
			ДобавитьЗапись(Итог, СтрокаУченика.Ученик, Объект.ГруппаВ, День, Истина);
		КонецЕсли;
	КонецЦикла;
	Возврат Итог;

КонецФункции

//Записи документа в регистре сейчас (ТаблицаЗаписей); у нового документа — пустая.
Функция ЗаписиДокумента(Ссылка) Экспорт

	Итог = ТаблицаЗаписей();
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Итог;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Состав.Ученик КАК Ученик,
	|	Состав.ГруппаОбучения КАК ГруппаОбучения,
	|	Состав.Период КАК Период,
	|	Состав.Состоит КАК Состоит
	|ИЗ
	|	РегистрСведений.УЗ_СоставГрупп КАК Состав
	|ГДЕ
	|	Состав.Регистратор = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Итог.Добавить(), Выборка);
	КонецЦикла;
	Возврат Итог;

КонецФункции

//План перевода — ЕДИНАЯ функция проведения, отмены проведения и предпросмотра формы.
//  Объект — документ (объект); Прежние — записи документа в регистре сейчас (ЗаписиДокумента: у непроведённого —
//  пустые); Новые — что он запишет (НовыеЗаписи; при отмене проведения — пустая таблица);
//  ПриПроведении — Истина: проверять шапку и состав (при отмене проведения — только последствия).
//Возврат: Структура
//  Ошибки — Массив Структура(Текст, Поле): перевод невозможен целиком, не меняется ничего;
//  Предупреждения — Массив строк;
//  Убрать, Добавить — ТаблицаЗначений Урок, Дата, Ученик, ГруппаОбучения: уроки-планы, из которых ученик уйдёт и в
//  которые добавится.
Функция ПланПеревода(Объект, Прежние, Новые, ПриПроведении = Истина) Экспорт

	План = Новый Структура("Ошибки, Предупреждения, Убрать, Добавить", Новый Массив, Новый Массив, ТаблицаУроков(),
		ТаблицаУроков());
	Если ПриПроведении Тогда
		ПроверитьШапку(Объект, План);
		Если План.Ошибки.Количество() > 0 Тогда
			Возврат План;
		КонецЕсли;
	КонецЕсли;

	Записи = ТаблицаЗаписей();
	Для Каждого Запись Из Прежние Цикл
		ЗаполнитьЗначенияСвойств(Записи.Добавить(), Запись);
	КонецЦикла;
	Для Каждого Запись Из Новые Цикл
		ЗаполнитьЗначенияСвойств(Записи.Добавить(), Запись);
	КонецЦикла;
	Если Записи.Количество() = 0 Тогда
		Возврат План;
	КонецЕсли;
	Ученики = РазличныеЗначения(Записи, "Ученик");
	Группы = РазличныеЗначения(Записи, "ГруппаОбучения");
	Ссылка = ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка, Неопределено);
	ИсторияБез = РегистрыСведений.УЗ_СоставГрупп.ИсторияПар(Ученики, Группы, Ссылка);

	Если ПриПроведении Тогда
		ПроверитьСостав(Объект, ИсторияБез, План);
	КонецЕсли;
	ПроверитьБолееПоздние(ИсторияБез, Записи, План);
	Если План.Ошибки.Количество() > 0 Тогда
		Возврат План;
	КонецЕсли;

	Было = СоединитьИсторию(ИсторияБез, Прежние);
	Станет = СоединитьИсторию(ИсторияБез, Новые);
	Записи.Сортировать("Период");
	СобратьУроки(Записи, Ученики, Группы, Было, Станет, План);

	Если ПриПроведении И ЗначениеЗаполнено(Объект.ГруппаИз) И ЗначениеЗаполнено(Объект.ГруппаВ)
		И Объект.ГруппаИз.ПредметОбучения <> Объект.ГруппаВ.ПредметОбучения Тогда
		План.Предупреждения.Добавить(СтрШаблон(
			НСтр("ru = 'У групп разные предметы (%1 — «%2», %3 — «%4»): абонемент по предмету «%2» к урокам "
				+ "группы %3 не подойдёт — занятия будут списываться по тарифу, пока не оформлен абонемент по «%4»'"),
			Объект.ГруппаИз, Объект.ГруппаИз.ПредметОбучения, Объект.ГруппаВ, Объект.ГруппаВ.ПредметОбучения));
	КонецЕсли;
	Возврат План;

КонецФункции

//Проведение: план → проверки целиком → запись регистра и перестроение планов. Вызывается из ОбработкаПроведения.
Процедура Провести(Объект, Отказ) Экспорт

	Прежние = ПрежниеЗаписи(Объект);
	Новые = НовыеЗаписи(Объект);
	Заблокировать(Прежние, Новые);
	План = ПланПеревода(Объект, Прежние, Новые);
	Если СообщитьОшибки(Объект, План, Отказ) Тогда
		Возврат;
	КонецЕсли;
	Для Каждого Предупреждение Из План.Предупреждения Цикл
		УЗ_ОбщийКлиентСервер.СообщитьПользователю(Предупреждение);
	КонецЦикла;

	//регистр — до записи уроков: запись урока группы проверяет состав (ученик с «Только выбранные группы»)
	Набор = Объект.Движения.УЗ_СоставГрупп;
	Набор.Записывать = Истина;
	Набор.Очистить();
	Для Каждого Запись Из Новые Цикл
		Движение = Набор.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Запись);
	КонецЦикла;
	Набор.Записать();
	Набор.Записывать = Ложь;

	ПрименитьПлан(Объект, План, Отказ);
	Если Не Отказ И Не ЗначениеЗаполнено(Объект.ГруппаВ) Тогда
		ПодсказатьВыбывшим(Объект);
	КонецЕсли;

КонецПроцедуры

//Отмена проведения (и пометка удаления проведённого): тот же план без записей документа — ученики возвращаются в
//планы прежней группы и уходят из планов новой; проведённые уроки, где ученик был уже членом новой группы, отменить
//перевод не дают (отказ с перечнем), как и более поздний документ по тем же ученику и группе.
Процедура ОтменитьПроведение(Объект, Отказ) Экспорт

	Прежние = ПрежниеЗаписи(Объект);
	Новые = ТаблицаЗаписей();
	Заблокировать(Прежние, Новые);
	План = ПланПеревода(Объект, Прежние, Новые, Ложь);
	Если СообщитьОшибки(Объект, План, Отказ) Тогда
		Возврат;
	КонецЕсли;
	Набор = Объект.Движения.УЗ_СоставГрупп;
	Набор.Записывать = Истина;
	Набор.Очистить();
	Набор.Записать();
	ПрименитьПлан(Объект, План, Отказ);

КонецПроцедуры

//Предпросмотр для формы: Структура(Ошибки — Массив строк, Предупреждения — Массив строк, Убрать, Добавить —
//Массив Структура(Урок, Ученик)). Тот же план, что проведёт документ. Объект — документ или ссылка на записанный
//(внешнее соединение объект документа в серверную функцию не передаёт).
Функция Предпросмотр(Знач Объект) Экспорт

	Если ТипЗнч(Объект) = Тип("ДокументСсылка.УЗ_ПереводУченика") Тогда
		Объект = Объект.ПолучитьОбъект();
	КонецЕсли;

	Итог = Новый Структура("Ошибки, Предупреждения, Убрать, Добавить", Новый Массив, Новый Массив, Новый Массив,
		Новый Массив);
	Прежние = ?(Объект.Проведен, ЗаписиДокумента(Объект.Ссылка), ТаблицаЗаписей());
	План = ПланПеревода(Объект, Прежние, НовыеЗаписи(Объект));
	Для Каждого Ошибка Из План.Ошибки Цикл
		Итог.Ошибки.Добавить(Ошибка.Текст);
	КонецЦикла;
	Итог.Предупреждения = План.Предупреждения;
	Для Каждого СтрокаПлана Из План.Убрать Цикл
		Итог.Убрать.Добавить(Новый Структура("Урок, Ученик", СтрокаПлана.Урок, СтрокаПлана.Ученик));
	КонецЦикла;
	Для Каждого СтрокаПлана Из План.Добавить Цикл
		Итог.Добавить.Добавить(Новый Структура("Урок, Ученик", СтрокаПлана.Урок, СтрокаПлана.Ученик));
	КонецЦикла;
	Возврат Итог;

КонецФункции

//Программное зачисление (тесты, обработки): документ «Перевод ученика» без группы «Из» на день Дата проводится;
//ученики, которые на эту дату уже в группе, пропускаются. Отказ проведения не бросает исключение — причина в Текст.
//Возврат: Структура(Документ — ссылка или Неопределено (зачислять некого), Успех, Текст).
Функция Зачислить(Ученики, ГруппаОбучения, Дата, Организация = Неопределено, Причина = "") Экспорт

	Итог = Новый Структура("Документ, Успех, Текст", Неопределено, Истина, "");
	Перевод = НовоеЗачисление(Ученики, ГруппаОбучения, Дата, Организация, Причина);
	Если Перевод = Неопределено Тогда
		Возврат Итог;
	КонецЕсли;
	Попытка
		Перевод.Записать(РежимЗаписиДокумента.Проведение);
		Итог.Документ = Перевод.Ссылка;
	Исключение
		Причины = Новый Массив;
		Для Каждого Сообщение Из ПолучитьСообщенияПользователю(Истина) Цикл
			Причины.Добавить(Сообщение.Текст);
		КонецЦикла;
		Если Причины.Количество() = 0 Тогда
			Причины.Добавить(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецЕсли;
		Итог.Успех = Ложь;
		Итог.Текст = СтрСоединить(Причины, "; ");
	КонецПопытки;
	Возврат Итог;

КонецФункции

//Незаписанный документ зачисления в группу на день Дата — ученики, которые на эту дату ещё не в группе;
//Неопределено — зачислять некого. Первый запуск проводит его в своей транзакции (отказ — исключение, откат всего).
Функция НовоеЗачисление(Ученики, ГруппаОбучения, Дата, Организация = Неопределено, Причина = "") Экспорт

	Перевод = Документы.УЗ_ПереводУченика.СоздатьДокумент();
	Перевод.Дата = НачалоДня(Дата);
	Перевод.ГруппаВ = ГруппаОбучения;
	Перевод.Причина = Причина;
	Если ЗначениеЗаполнено(Организация) Тогда
		Перевод.Организация = Организация;
	КонецЕсли;
	Группы = Новый Массив;
	Группы.Добавить(ГруппаОбучения);
	История = РегистрыСведений.УЗ_СоставГрупп.ИсторияПар(Ученики, Группы);
	Для Каждого Ученик Из Ученики Цикл
		Если ЗначениеЗаполнено(Ученик) И Перевод.Ученики.Найти(Ученик, "Ученик") = Неопределено
			И Не ПустаяСтрока(
				РегистрыСведений.УЗ_СоставГрупп.ПричинаПоИстории(История, Ученик, ГруппаОбучения, Дата)) Тогда
			Перевод.Ученики.Добавить().Ученик = Ученик;
		КонецЕсли;
	КонецЦикла;
	Возврат ?(Перевод.Ученики.Количество() = 0, Неопределено, Перевод);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТаблицаЗаписей()

	Итог = Новый ТаблицаЗначений;
	Итог.Колонки.Добавить("Ученик", Новый ОписаниеТипов("СправочникСсылка.УЗ_ФизЛица"));
	Итог.Колонки.Добавить("ГруппаОбучения", Новый ОписаниеТипов("СправочникСсылка.УЗ_ГруппыОбучения"));
	Итог.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	Итог.Колонки.Добавить("Состоит", Новый ОписаниеТипов("Булево"));
	Возврат Итог;

КонецФункции

Функция ТаблицаУроков()

	Итог = Новый ТаблицаЗначений;
	Итог.Колонки.Добавить("Урок", Новый ОписаниеТипов("ДокументСсылка.УЗ_Урок"));
	Итог.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	Итог.Колонки.Добавить("Ученик", Новый ОписаниеТипов("СправочникСсылка.УЗ_ФизЛица"));
	Итог.Колонки.Добавить("ГруппаОбучения", Новый ОписаниеТипов("СправочникСсылка.УЗ_ГруппыОбучения"));
	Возврат Итог;

КонецФункции

Процедура ДобавитьЗапись(Записи, Ученик, ГруппаОбучения, Период, Состоит)

	Запись = Записи.Добавить();
	Запись.Ученик = Ученик;
	Запись.ГруппаОбучения = ГруппаОбучения;
	Запись.Период = Период;
	Запись.Состоит = Состоит;

КонецПроцедуры

Функция РазличныеЗначения(Таблица, Колонка)

	Копия = Таблица.Скопировать(, Колонка);
	Копия.Свернуть(Колонка);
	Возврат Копия.ВыгрузитьКолонку(Колонка);

КонецФункции

//Записи документа до перепроведения/отмены — их кладёт ПередЗаписью (при автоудалении движений платформа стирает
//их до обработки проведения); без них — из регистра.
Функция ПрежниеЗаписи(Объект)

	Прежние = Неопределено;
	Если Объект.ДополнительныеСвойства.Свойство("УЗ_ПрежниеЗаписи", Прежние) Тогда
		Возврат Прежние;
	КонецЕсли;
	Возврат ЗаписиДокумента(Объект.Ссылка);

КонецФункции

//Исключительная блокировка состава всех учеников документа (прежних и новых): два перевода одного ученика не
//пройдут проверки на одном и том же состоянии.
Процедура Заблокировать(Прежние, Новые)

	Ученики = Новый Массив;
	Для Каждого Запись Из Прежние Цикл
		Если Ученики.Найти(Запись.Ученик) = Неопределено Тогда
			Ученики.Добавить(Запись.Ученик);
		КонецЕсли;
	КонецЦикла;
	Для Каждого Запись Из Новые Цикл
		Если Ученики.Найти(Запись.Ученик) = Неопределено Тогда
			Ученики.Добавить(Запись.Ученик);
		КонецЕсли;
	КонецЦикла;
	Если Ученики.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Блокировка = Новый БлокировкаДанных;
	Для Каждого Ученик Из Ученики Цикл
		Элемент = Блокировка.Добавить("РегистрСведений.УЗ_СоставГрупп");
		Элемент.Режим = РежимБлокировкиДанных.Исключительный;
		Элемент.УстановитьЗначение("Ученик", Ученик);
	КонецЦикла;
	Блокировка.Заблокировать();

КонецПроцедуры

//Шапка и список: есть ученики, задана хотя бы одна группа, группы разные, ученик в списке один раз.
Процедура ПроверитьШапку(Объект, План)

	Если Не ЗначениеЗаполнено(Объект.ГруппаИз) И Не ЗначениеЗаполнено(Объект.ГруппаВ) Тогда
		ДобавитьОшибку(План, НСтр("ru = 'Укажите группу: «Из группы» — откуда уходят, «В группу» — куда переходят "
			+ "(пусто «Из группы» — зачисление, пусто «В группу» — выбытие)'"), "ГруппаВ");
	ИначеЕсли Объект.ГруппаИз = Объект.ГруппаВ Тогда
		ДобавитьОшибку(План, НСтр("ru = 'Группы «Из группы» и «В группу» совпадают — переводить некуда'"), "ГруппаВ");
	КонецЕсли;
	Если Объект.Ученики.Количество() = 0 Тогда
		ДобавитьОшибку(План, НСтр("ru = 'Добавьте учеников в список'"), "Ученики");
	КонецЕсли;
	Встречены = Новый Соответствие;
	Для Каждого СтрокаУченика Из Объект.Ученики Цикл
		Поле = ПолеУченика(СтрокаУченика);
		Если Не ЗначениеЗаполнено(СтрокаУченика.Ученик) Тогда
			ДобавитьОшибку(План, СтрШаблон(НСтр("ru = 'Строка %1: не выбран ученик'"), СтрокаУченика.НомерСтроки),
				Поле);
		ИначеЕсли Встречены[СтрокаУченика.Ученик] <> Неопределено Тогда
			ДобавитьОшибку(План, СтрШаблон(НСтр("ru = 'Строка %1: ученик %2 уже есть в строке %3'"),
				СтрокаУченика.НомерСтроки, СтрокаУченика.Ученик, Встречены[СтрокаУченика.Ученик]), Поле);
		Иначе
			Встречены.Вставить(СтрокаУченика.Ученик, СтрокаУченика.НомерСтроки);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

//Состав на дату без этого документа: ученик в группе «Из», не выбыл и не в группе «В»; в тот же день по той же
//группе у ученика нет другого документа (запись регистра — одна на день).
Процедура ПроверитьСостав(Объект, ИсторияБез, План)

	День = НачалоДня(Объект.Дата);
	Для Каждого СтрокаУченика Из Объект.Ученики Цикл
		Ученик = СтрокаУченика.Ученик;
		Поле = ПолеУченика(СтрокаУченика);
		Если ЗначениеЗаполнено(Объект.ГруппаИз) Тогда
			Причина = РегистрыСведений.УЗ_СоставГрупп.ПричинаПоИстории(ИсторияБез, Ученик, Объект.ГруппаИз, День);
			Если Не ПустаяСтрока(Причина) Тогда
				ДобавитьОшибку(План, СтрШаблон(НСтр("ru = 'Строка %1: ученик %2 на %3 не в группе %4 — %5'"),
					СтрокаУченика.НомерСтроки, Ученик, Формат(День, "ДЛФ=D"), Объект.ГруппаИз, Причина), Поле);
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ГруппаВ) Тогда
			Если Ученик.Выбыл Тогда
				ДобавитьОшибку(План, СтрШаблон(
					НСтр("ru = 'Строка %1: ученик %2 выбыл (отметка «Выбыл» в карточке) — в группу его не записать'"),
					СтрокаУченика.НомерСтроки, Ученик), Поле);
			ИначеЕсли ПустаяСтрока(РегистрыСведений.УЗ_СоставГрупп.ПричинаПоИстории(ИсторияБез, Ученик, Объект.ГруппаВ,
				День)) Тогда
				ДобавитьОшибку(План, СтрШаблон(НСтр("ru = 'Строка %1: ученик %2 на %3 уже в группе %4'"),
					СтрокаУченика.НомерСтроки, Ученик, Формат(День, "ДЛФ=D"), Объект.ГруппаВ), Поле);
			КонецЕсли;
		КонецЕсли;
		Для Каждого Запись Из ИсторияБез.НайтиСтроки(Новый Структура("Ученик, Период", Ученик, День)) Цикл
			Если Запись.ГруппаОбучения = Объект.ГруппаИз Или Запись.ГруппаОбучения = Объект.ГруппаВ Тогда
				ДобавитьОшибку(План, СтрШаблон(
					НСтр("ru = 'Строка %1: у ученика %2 на %3 по группе %4 уже есть %5 — один перевод в день'"),
					СтрокаУченика.НомерСтроки, Ученик, Формат(День, "ДЛФ=D"), Запись.ГруппаОбучения,
						Запись.Регистратор),
					Поле);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

//Более поздний документ по тем же ученику и группе (запись регистра позже записи этого документа) — отказ: его
//проверки прошли на прежнем составе, сначала отменить его проведение (как с кадровыми документами в типовых).
Процедура ПроверитьБолееПоздние(ИсторияБез, Записи, План)

	Названы = Новый Соответствие;
	Для Каждого Запись Из Записи Цикл
		Для Каждого Поздняя Из ИсторияБез.НайтиСтроки(Новый Структура("Ученик, ГруппаОбучения", Запись.Ученик,
			Запись.ГруппаОбучения)) Цикл
			Если Поздняя.Период <= Запись.Период Или Названы[Поздняя.Регистратор] <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Названы.Вставить(Поздняя.Регистратор, Истина);
			ДобавитьОшибку(План, СтрШаблон(
				НСтр("ru = 'Позже есть %1 (с %2, ученик %3, группа %4) — сначала отмените его проведение'"),
				Поздняя.Регистратор, Формат(Поздняя.Период, "ДЛФ=D"), Запись.Ученик, Запись.ГруппаОбучения),
				"Дата");
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

//История без документа плюс записи (прежние или новые) — по периоду: состав «было» или «станет».
Функция СоединитьИсторию(ИсторияБез, Записи)

	Итог = ИсторияБез.Скопировать();
	Для Каждого Запись Из Записи Цикл
		ЗаполнитьЗначенияСвойств(Итог.Добавить(), Запись);
	КонецЦикла;
	Итог.Сортировать("Период");
	Возврат Итог;

КонецФункции

//Уроки групп документа с самой ранней даты его записей: где членство пары «ученик — группа» на дату урока меняется
//(было ≠ станет), план получает ученика (стал членом, его нет в уроке) или теряет (перестал быть членом, он в уроке).
//Проведённый урок, из которого ученика пришлось бы убрать, — ошибка с перечнем уроков (как заморозка В17): проведённые
//уроки не меняются никогда, а оставить в них не-члена группы задним числом нельзя.
Процедура СобратьУроки(Записи, Ученики, Группы, Было, Станет, План)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Урок.Ссылка КАК Урок,
	|	Урок.Дата КАК Дата,
	|	Урок.ГруппаОбучения КАК ГруппаОбучения,
	|	Урок.Проведен КАК Проведен
	|ПОМЕСТИТЬ ВТ_Уроки
	|ИЗ
	|	Документ.УЗ_Урок КАК Урок
	|ГДЕ
	|	НЕ Урок.ПометкаУдаления
	|	И Урок.ГруппаОбучения В(&Группы)
	|	И Урок.Дата >= &Начало
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Урок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Уроки.Урок КАК Урок,
	|	Уроки.Дата КАК Дата,
	|	Уроки.ГруппаОбучения КАК ГруппаОбучения,
	|	Уроки.Проведен КАК Проведен
	|ИЗ
	|	ВТ_Уроки КАК Уроки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УченикиУрока.Ссылка КАК Урок,
	|	УченикиУрока.Ученик КАК Ученик
	|ИЗ
	|	Документ.УЗ_Урок.Ученики КАК УченикиУрока
	|ГДЕ
	|	УченикиУрока.Ссылка В
	|			(ВЫБРАТЬ
	|				Уроки.Урок
	|			ИЗ
	|				ВТ_Уроки КАК Уроки)
	|	И УченикиУрока.Ученик В(&Ученики)";
	Запрос.УстановитьПараметр("Группы", Группы);
	Запрос.УстановитьПараметр("Ученики", Ученики);
	Запрос.УстановитьПараметр("Начало", Записи[0].Период);
	Пакет = Запрос.ВыполнитьПакет();
	Уроки = Пакет[1].Выгрузить();
	ВУроках = Пакет[2].Выгрузить();

	Пары = Записи.Скопировать(, "Ученик, ГруппаОбучения");
	Пары.Свернуть("Ученик, ГруппаОбучения");
	Проведенные = Новый Соответствие;      //ученик → Массив текстов проведённых уроков
	Для Каждого Урок Из Уроки Цикл
		Для Каждого Пара Из Пары.НайтиСтроки(Новый Структура("ГруппаОбучения", Урок.ГруппаОбучения)) Цикл
			БылВГруппе = ПустаяСтрока(РегистрыСведений.УЗ_СоставГрупп.ПричинаПоИстории(Было, Пара.Ученик,
				Пара.ГруппаОбучения, Урок.Дата));
			БудетВГруппе = ПустаяСтрока(РегистрыСведений.УЗ_СоставГрупп.ПричинаПоИстории(Станет, Пара.Ученик,
				Пара.ГруппаОбучения, Урок.Дата));
			Если БылВГруппе = БудетВГруппе Тогда
				Продолжить;
			КонецЕсли;
			ЕстьВУроке = ВУроках.НайтиСтроки(Новый Структура("Урок, Ученик", Урок.Урок, Пара.Ученик)).Количество() > 0;
			Если Не БудетВГруппе И ЕстьВУроке И Урок.Проведен Тогда
				Список = Проведенные[Пара.Ученик];
				Если Список = Неопределено Тогда
					Список = Новый Массив;
					Проведенные.Вставить(Пара.Ученик, Список);
				КонецЕсли;
				Список.Добавить(Строка(Урок.Урок));
			ИначеЕсли Не БудетВГруппе И ЕстьВУроке Тогда
				СтрокаПлана = План.Убрать.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаПлана, Урок);
				СтрокаПлана.Ученик = Пара.Ученик;
			ИначеЕсли БудетВГруппе И Не ЕстьВУроке И Не Урок.Проведен Тогда
				СтрокаПлана = План.Добавить.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаПлана, Урок);
				СтрокаПлана.Ученик = Пара.Ученик;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	Для Каждого УрокиУченика Из Проведенные Цикл
		ДобавитьОшибку(План, СтрШаблон(
			НСтр("ru = 'Ученик %1 уже был на проведённых уроках, из которых перевод убрал бы его задним числом: %2. "
			+ "Укажите дату после последнего проведённого урока или отмените проведение этих уроков'"),
			УрокиУченика.Ключ, СтрСоединить(УрокиУченика.Значение, "; ")), "Дата");
	КонецЦикла;
	Если План.Ошибки.Количество() > 0 Тогда
		План.Убрать.Очистить();
		План.Добавить.Очистить();
	КонецЕсли;

КонецПроцедуры

//Изменения планов: ученик убирается из строк урока или добавляется строкой с тарифом по В20, скидкой ученика,
//«К оплате» и абонементом на дату урока (как помощник уроков). Урок записывается без проведения (он план). Отказ
//записи — сообщение и Отказ: транзакция проведения откатывается целиком.
Процедура ПрименитьПлан(Документ, План, Отказ)

	Изменения = План.Убрать.Скопировать(, "Урок");
	Для Каждого СтрокаПлана Из План.Добавить Цикл
		Изменения.Добавить().Урок = СтрокаПлана.Урок;
	КонецЦикла;
	Изменения.Свернуть("Урок");
	Для Каждого Изменение Из Изменения Цикл
		Урок = Изменение.Урок.ПолучитьОбъект();
		Для Каждого СтрокаПлана Из План.Убрать.НайтиСтроки(Новый Структура("Урок", Изменение.Урок)) Цикл
			Для Каждого СтрокаУченика Из Урок.Ученики.НайтиСтроки(Новый Структура("Ученик", СтрокаПлана.Ученик)) Цикл
				Урок.Ученики.Удалить(СтрокаУченика);
			КонецЦикла;
		КонецЦикла;
		НовыеСтроки = Новый Массив;
		Для Каждого СтрокаПлана Из План.Добавить.НайтиСтроки(Новый Структура("Урок", Изменение.Урок)) Цикл
			СтрокаУченика = Урок.Ученики.Добавить();
			СтрокаУченика.Ученик = СтрокаПлана.Ученик;
			СтрокаУченика.Тариф = Документы.УЗ_Урок.ТарифСтрокиУченика(СтрокаПлана.Ученик, Урок.ГруппаОбучения,
				Урок.Тариф);
			СтрокаУченика.Скидка = СтрокаПлана.Ученик.Скидка;
			СтрокаУченика.СписатьОплату = Истина;
			НовыеСтроки.Добавить(СтрокаУченика);
		КонецЦикла;
		Если НовыеСтроки.Количество() > 0 Тогда
			Справочники.УЗ_Абонемент.ПодставитьАбонементы(Урок, НовыеСтроки);
		КонецЕсли;
		Записан = УЗ_Общий.ЗаписатьУрок(Урок, Ложь);
		Если Не Записан.Успех Тогда
			УЗ_Общий.СообщитьОбОшибкеОбъекта(Документ,
				СтрШаблон(НСтр("ru = 'Урок %1 не записан: %2. Перевод не выполнен'"),
				Изменение.Урок, Записан.Текст), "Дата", Отказ);
			Возврат;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция СообщитьОшибки(Объект, План, Отказ)

	Для Каждого Ошибка Из План.Ошибки Цикл
		УЗ_Общий.СообщитьОбОшибкеОбъекта(Объект, Ошибка.Текст, Ошибка.Поле, Отказ);
	КонецЦикла;
	Возврат Отказ;

КонецФункции

Процедура ДобавитьОшибку(План, Текст, Поле)
	План.Ошибки.Добавить(Новый Структура("Текст, Поле", Текст, Поле));
КонецПроцедуры

Функция ПолеУченика(СтрокаУченика)
	Возврат "Ученики[" + Формат(СтрокаУченика.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].Ученик";
КонецФункции

//Выбытие: у кого после него не осталось ни одной группы — подсказка про отметку «Выбыл» (В18). Сама отметка не
//ставится (решение В29): выбыть из группы — не значит уйти из студии (индивидуальные занятия, возврат позже).
Процедура ПодсказатьВыбывшим(Объект)

	Ученики = Объект.Ученики.ВыгрузитьКолонку("Ученик");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Состав.Ученик КАК Ученик
	|ИЗ
	|	РегистрСведений.УЗ_СоставГрупп.СрезПоследних(&Дата, Ученик В (&Ученики)) КАК Состав
	|ГДЕ
	|	Состав.Состоит";
	Запрос.УстановитьПараметр("Дата", КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("Ученики", Ученики);
	ВГруппах = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ученик");
	Для Каждого Ученик Из Ученики Цикл
		Если ВГруппах.Найти(Ученик) = Неопределено И Не Ученик.Выбыл Тогда
			УЗ_ОбщийКлиентСервер.СообщитьПользователю(СтрШаблон(
				НСтр("ru = 'У ученика %1 больше нет групп. Если он уходит из студии — отметьте «Выбыл» "
					+ "в его карточке'"), Ученик));
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
